QGDsolver/tutorials/interQHDFoam/2D/damBreak/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

touch damBreak.foam
rm -rf 0
cp -rf 0.orig/ 0/
runApplication blockMesh
runApplication `getApplication`

#------------------------------------------------------------------------------
